Examinator/src/InformationRegisters/СотрудникиСУО/СотрудникиСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СотрудникиСУО</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизацииСУО</types>
    </type>
  </resources>
  <resources>
    <name>ПодразделениеПредприятия</name>
    <type>
      <types>CatalogRef.ПодразделенияПредприятияСУО</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиСУО</types>
    </type>
  </resources>
  <attributes>
    <name>Уволен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТабельныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/СотрудникиСУО/Forms/ФормаСпискаСотрудников/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Должность                = Параметры.Должность;
	Организация              = Параметры.Организация;
	ПодразделениеОрганизации = Параметры.ПодразделениеОрганизации;
	ПодразделениеПредприятия = Параметры.ПодразделениеПредприятия;
	
	Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
		Организация = ПодразделениеОрганизации.Владелец;	
	КонецЕсли;
	
	Если Параметры.РежимВыбора Тогда
		Элементы.Пользователи.РежимВыбора = Истина;
	КонецЕсли;
	
	СписокПользователей.Параметры.УстановитьЗначениеПараметра("Дата", Дата);
	СписокПользователей.Параметры.УстановитьЗначениеПараметра("ПроведениеОбучения", Параметры.ПроведениеОбучения);
	
	Если ЗначениеЗаполнено(Параметры.ПроведениеОбучения) Тогда
		
		Элементы.ИнформацияОПрохожденииМероприятия.Видимость = Истина;
		
		НаименованиеМероприятия = Документы.ПроведениеОбученияСУО.НаименованиеОбучения(Параметры.ПроведениеОбучения);
		
		ИнформацияОПроведенииМероприятия = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.ПроведениеОбучения, "Дата");
		
		Заголовок = НСтр("ru = 'Список сотрудников мероприятия ""%1"" от %2'");
		Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Заголовок, НаименованиеМероприятия, ИнформацияОПроведенииМероприятия.Дата);
		
	Иначе
		
		Элементы.ИнформацияОПрохожденииМероприятия.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьДоступностьЭлементовФормыНаКлиенте();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ПодразделениеОрганизации = ПредопределенноеЗначение("Справочник.ПодразделенияОрганизацииСУО.ПустаяСсылка");
	ПодразделениеПредприятия = ПредопределенноеЗначение("Справочник.ПодразделенияПредприятияСУО.ПустаяСсылка");
	
	УстановитьДоступностьЭлементовФормыНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеОрганизацииПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормыНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПредприятияПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормыНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ДолжностьПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормыНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	СписокПользователей.Параметры.УстановитьЗначениеПараметра("Дата", Дата);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьУволенныхПриИзменении(Элемент)
	УстановитьДоступностьЭлементовФормыНаКлиенте();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура УстановитьДоступностьЭлементовФормыНаКлиенте()
	
	Если ЗначениеЗаполнено(Организация) Тогда
		
		ПодразделениеПредприятия = ПредопределенноеЗначение("Справочник.ПодразделенияПредприятияСУО.ПустаяСсылка");
		
		Элементы.ПодразделениеОрганизации.Доступность = Истина;
		Элементы.ПодразделениеПредприятия.Доступность = Ложь;
		
		МассивПараметровВыбора = Новый Массив();
		МассивПараметровВыбора.Добавить(Новый ПараметрВыбора("Отбор.Владелец", Организация));
		Элементы.ПодразделениеОрганизации.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметровВыбора);
		
	Иначе
		
		ПодразделениеОрганизации = ПредопределенноеЗначение("Справочник.ПодразделенияОрганизацииСУО.ПустаяСсылка");
		
		Элементы.ПодразделениеОрганизации.Доступность = Ложь;
		Элементы.ПодразделениеПредприятия.Доступность = Истина;
		
	КонецЕсли;
	
	// Устанавливаем отборы
	
	Если ЗначениеЗаполнено(Должность) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокПользователей.Отбор, "Должность", Должность);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(СписокПользователей.Отбор, "Должность");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокПользователей.Отбор, "Организация", Организация);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(СписокПользователей.Отбор, "Организация");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокПользователей.Отбор, "ПодразделениеОрганизации", ПодразделениеОрганизации);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(СписокПользователей.Отбор, "ПодразделениеОрганизации");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПодразделениеПредприятия) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокПользователей.Отбор, "ПодразделениеПредприятия", ПодразделениеПредприятия);
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(СписокПользователей.Отбор, "ПодразделениеПредприятия");
	КонецЕсли;
	
	Если ПоказатьУволенных Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(СписокПользователей.Отбор, "Уволен");
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(СписокПользователей.Отбор, "Уволен", Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
